# Web ToDoアプリ
(見た目上は)画面遷移がないToDoアプリ
タスク,優先度,編集,完了
これらを横並びにし、帯のような四角形を1つのToDoとする。
このToDoを縦に並べる形で配置する。
ToDo最後尾の下にタスク新規追加ボタンを配置する。

## 使用技術スタック
- フロントエンド
	- html
	- javascript
	- css(最初は使わず、最低限の機能が完成したのちに拡張として使用する)
- バックエンド
	- Rust
		- axum
- DB
	- SQLite


## RDBMS ToDoの持つフィールド
- id(String) // unique 
- task(String)
- Priority(符号無し整数型)
またバックエンドのRustでも同様の構造体で管理する


## 鯖構築
Virtual Box 上で Rocky Linux9 に環境を構築する。
ポート3000番を開きローカルのWindowsからでもアクセス可能にする。
セキュリティ上の問題を解決していない可能性があるのでローカル以外でのアクセスは出来ないようにする。


